pr-preview/pr-32/2026.06.30.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[file:2026.06.23.html][先週号]] [[file:index.html][上へ]] [[file:2026.07.07.html][次週号]]

こんにちは

2026年6月23日から30日までの週の OCaml Weekly News をお届けします。

#+TOC: headlines 1


* Sek の新リリース
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/new-release-of-sek/18281/1

** François Pottier が発表しました


効率的な ephemeral（ミュータブル）および persistent（イミュータブル）な /シーケンス/ データ構造を提供し、これら二つの形式間の効率的な変換もサポートするライブラリ [[https://gitlab.inria.fr/fpottier/sek][Sek]] の新リリースを発表できることを嬉しく思います。

この新リリースでは、ランダムアクセス（~get~、~set~）、分割、連結など複数の操作を高速化する最適化が導入されています。詳細については [[https://gitlab.inria.fr/fpottier/sek/-/blob/master/CHANGES.md?ref_type=heads][変更履歴]] をご覧ください。

#+begin_example
  opam update && opam install sek
#+end_example

Happy hacking,
Arthur Charguéraud & François Pottier.
      

** François Pottier が後に追記しました


[[https://cambium.inria.fr/~fpottier/sek/doc/sek/Sek/][ドキュメント]] へのリンクも追加させてください。
      



* Js_of_ocaml / Wasm_of_ocaml 6.4
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/ann-js-of-ocaml-wasm-of-ocaml-6-4/18282/1

** Hhugo が発表しました


*js_of_ocaml* および *wasm_of_ocaml 6.4.0* の同時リリースを発表できることを嬉しく思います。

Js_of_ocaml は OCaml バイトコードから JavaScript へのコンパイラです。ブラウザや Node.js などの JavaScript 環境で純粋な OCaml プログラムを実行できます。

Wasm_of_ocaml は OCaml バイトコードから WebAssembly へのコンパイラです。js_of_ocaml との高い互換性を持ち、js_of_ocaml の代わりに wasm_of_ocaml でプログラムをコンパイルすることで全体的なパフォーマンス向上が期待できます。

バージョン 6.3 以降の主な変更点：

*** ツールチェーン

- *OCaml 5.5.0 サポート*。
- *OxCaml サポート*。

*** wasm_of_ocaml

- *WASI 0.1 サポート* — スタンドアロンの WASI ランタイム（wasmtime など）をターゲットにでき、JavaScript ホストは不要。
- *Dynlink とトップレベルのサポート* — OCaml トップレベルが Wasm バックエンドで動作するようになりました。
- [[https://github.com/WebAssembly/stack-switching][Stack Switching proposal]] に基づく *代替 effects バックエンド*。
- *Pure-Wasm の zstd と BLAKE2b* — 圧縮された値のアンマーシャリングと ~Digest.BLAKE2{512,256,128}~ で JavaScript shim が不要になり、WASI でも動作します。
- レガシーの ~num~ ライブラリが Wasm で動作するようになりました（~nat~ プリミティブがノーオプスタブでした）。

*** ライブラリ — 新しい web API

- *~Promise~ モジュール* — JS Promise への型安全なバインディング。*Lwt 相互運用*（~Js_of_ocaml_lwt.Promise.{to_lwt,of_lwt}~）および Promise 型の ~Dom_html~ バインディング付き。
- *~Fetch~ + ~Abort~ モジュール* — 型付き ~AbortController~/~AbortSignal~ キャンセル機能を持つ Fetch API。
- *SVG 2 に合わせた ~Dom_svg~*、*popover API*、*~Intl.RelativeTimeFormat~*、新しい *~Performance~ モジュール*、追加の ~Console~ バインディング、その他多数の ~Dom_html~ バインディング。

*** バグ修正

- コンパイラ、ランタイム、ライブラリバインディング、PPX にわたる多数のバグ修正。

*** ⚠️ 破壊的変更

一部の変更はソース非互換です — 主に誤ったバインディングと動作を修正するためのもの — で、既存コードの更新が必要になる場合があります。[[https://github.com/ocsigen/js_of_ocaml/wiki/Upgrade-from-6.3.0-to-6.4.0][移行ガイド]]を参照してください。

[[https://ocsigen.org/js_of_ocaml/][ドキュメント]] および [[https://github.com/ocsigen/js_of_ocaml/blob/master/CHANGES.md][完全な変更履歴]] もご覧ください。
      

** Vincent Balat が続けて追記しました


同時に Eliom 12.1 もリリースしました。js_of_ocaml 6.4 と OCaml 5.5 の両方との互換性を提供します。
      



* Ocsipersist 2.1.0: Deriving を使った型安全な永続参照
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://discuss.ocaml.org/t/ann-ocsipersist-2-1-0-type-safe-persistent-references-with-deriving/18283/1

** Vincent Balat が発表しました


[[https://ocsigen.org/ocsipersist/][Ocsipersist]] 2.1.0 がリリースされました。永続参照、ストア、テーブルを ~Marshal~ の代わりに ~Deriving_Json~ でシリアライズできるようになりました。データはデータベース内で人間が読める形式になり、OCaml バージョン間でも安定しています。新しい API は完全に後方互換性があり、Ocsipersist は任意の OCaml プログラムのスタンドアロンライブラリとして動作します（Eliom や Ocsigen Server は不要です）。

#+begin_src ocaml
type user = { name : string; age : int } [@@deriving json]

(* 読み取り可能な JSON として保存される永続参照 *)
let visits = Ocsipersist.Ref_json.ref ~persistent:"visits" [%json: int] 0

let count_visit () =
  let%lwt n = Ocsipersist.Ref_json.get visits in
  Ocsipersist.Ref_json.set visits (n + 1)
#+end_src

完全なアナウンス: https://ocsigen.org/blog/posts/ocsipersist-2.1.0.html
      



* OCaml 5.5 以前における modular explicits
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://inbox.ci.dev/caml-list/6d5f115c-866d-4cc0-a102-73657778a0e2@inria.fr/T/

