ja/2026.06.30.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="2026.06.23.html">先週号</a> <a href="index.html">上へ</a> <a href="2026.07.07.html">次週号</a>
</p>

<p>
こんにちは
</p>

<p>
2026年6月23日から30日までの週の OCaml Weekly News をお届けします。
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">Sek の新リリース</a></li>
<li><a href="#2">Js_of_ocaml / Wasm_of_ocaml 6.4</a></li>
<li><a href="#3">Ocsipersist 2.1.0: Deriving を使った型安全な永続参照</a></li>
<li><a href="#4">OCaml 5.5 以前における modular explicits</a></li>
<li><a href="#5">LRgrep 0.9: OCaml と Menhir のためのより良い構文エラー</a></li>
<li><a href="#6">OCaml の静的解析</a></li>
<li><a href="#7">新リリース: OCaml 5.5 サポートを含む Merlin 5.8 と OCaml-LSP 1.27.0</a></li>
<li><a href="#8">duras 2.1.1 — プレーンテキストファイルとしての日々のノート</a></li>
<li><a href="#9">LexiFi（パリ）のソフトウェアエンジニア募集</a></li>
<li><a href="#10">Owebview: webview ライブラリへの OCaml バインディング</a></li>
<li><a href="#11">OCaml Runtime ミーティング: 7月6日（月）UTC 10:00（ロンドン/ケンブリッジ 10:00、パリ 11:00、シドニー 19:00）</a></li>
<li><a href="#org5844e52">過去の CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">Sek の新リリース</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/new-release-of-sek/18281/1">https://discuss.ocaml.org/t/new-release-of-sek/18281/1</a>
</p>
</div>

<div id="outline-container-org1057dc6" class="outline-3">
<h3 id="org1057dc6">François Pottier が発表しました</h3>
<div class="outline-text-3" id="text-org1057dc6">
<p>
効率的な ephemeral（ミュータブル）および persistent（イミュータブル）な <i>シーケンス</i> データ構造を提供し、これら二つの形式間の効率的な変換もサポートするライブラリ <a href="https://gitlab.inria.fr/fpottier/sek">Sek</a> の新リリースを発表できることを嬉しく思います。
</p>

<p>
この新リリースでは、ランダムアクセス（<code>get</code>、<code>set</code>）、分割、連結など複数の操作を高速化する最適化が導入されています。詳細については <a href="https://gitlab.inria.fr/fpottier/sek/-/blob/master/CHANGES.md?ref_type=heads">変更履歴</a> をご覧ください。
</p>

<pre class="example" id="org0ccf6ed">
opam update &amp;&amp; opam install sek
</pre>

<p>
Happy hacking,
Arthur Charguéraud &amp; François Pottier.
</p>
</div>
</div>


<div id="outline-container-org82a3551" class="outline-3">
<h3 id="org82a3551">François Pottier が後に追記しました</h3>
<div class="outline-text-3" id="text-org82a3551">
<p>
<a href="https://cambium.inria.fr/~fpottier/sek/doc/sek/Sek/">ドキュメント</a> へのリンクも追加させてください。
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">Js_of_ocaml / Wasm_of_ocaml 6.4</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-js-of-ocaml-wasm-of-ocaml-6-4/18282/1">https://discuss.ocaml.org/t/ann-js-of-ocaml-wasm-of-ocaml-6-4/18282/1</a>
</p>
</div>

<div id="outline-container-org1925932" class="outline-3">
<h3 id="org1925932">Hhugo が発表しました</h3>
<div class="outline-text-3" id="text-org1925932">
<p>
<b>js_of_ocaml</b> および <b>wasm_of_ocaml 6.4.0</b> の同時リリースを発表できることを嬉しく思います。
</p>

<p>
Js_of_ocaml は OCaml バイトコードから JavaScript へのコンパイラです。ブラウザや Node.js などの JavaScript 環境で純粋な OCaml プログラムを実行できます。
</p>

<p>
Wasm_of_ocaml は OCaml バイトコードから WebAssembly へのコンパイラです。js_of_ocaml との高い互換性を持ち、js_of_ocaml の代わりに wasm_of_ocaml でプログラムをコンパイルすることで全体的なパフォーマンス向上が期待できます。
</p>

<p>
バージョン 6.3 以降の主な変更点：
</p>
</div>

<div id="outline-container-org929f474" class="outline-4">
<h4 id="org929f474">ツールチェーン</h4>
<div class="outline-text-4" id="text-org929f474">
<ul class="org-ul">
<li><b>OCaml 5.5.0 サポート</b>。</li>
<li><b>OxCaml サポート</b>。</li>
</ul>
</div>
</div>

<div id="outline-container-org411e243" class="outline-4">
<h4 id="org411e243">wasm_of_ocaml</h4>
<div class="outline-text-4" id="text-org411e243">
<ul class="org-ul">
<li><b>WASI 0.1 サポート</b> — スタンドアロンの WASI ランタイム（wasmtime など）をターゲットにでき、JavaScript ホストは不要。</li>
<li><b>Dynlink とトップレベルのサポート</b> — OCaml トップレベルが Wasm バックエンドで動作するようになりました。</li>
<li><a href="https://github.com/WebAssembly/stack-switching">Stack Switching proposal</a> に基づく <b>代替 effects バックエンド</b>。</li>
<li><b>Pure-Wasm の zstd と BLAKE2b</b> — 圧縮された値のアンマーシャリングと <code>Digest.BLAKE2{512,256,128}</code> で JavaScript shim が不要になり、WASI でも動作します。</li>
<li>レガシーの <code>num</code> ライブラリが Wasm で動作するようになりました（<code>nat</code> プリミティブがノーオプスタブでした）。</li>
</ul>
</div>
</div>

<div id="outline-container-orge184bee" class="outline-4">
<h4 id="orge184bee">ライブラリ — 新しい web API</h4>
<div class="outline-text-4" id="text-orge184bee">
<ul class="org-ul">
<li><b><code>Promise</code> モジュール</b> — JS Promise への型安全なバインディング。<b>Lwt 相互運用</b>（<code>Js_of_ocaml_lwt.Promise.{to_lwt,of_lwt}</code>）および Promise 型の <code>Dom_html</code> バインディング付き。</li>
<li><b><code>Fetch</code> + <code>Abort</code> モジュール</b> — 型付き <code>AbortController~/~AbortSignal</code> キャンセル機能を持つ Fetch API。</li>
<li><b>SVG 2 に合わせた <code>Dom_svg</code></b>、<b>popover API</b>、<b><code>Intl.RelativeTimeFormat</code></b>、新しい <b><code>Performance</code> モジュール</b>、追加の <code>Console</code> バインディング、その他多数の <code>Dom_html</code> バインディング。</li>
</ul>
</div>
</div>

<div id="outline-container-org1a26558" class="outline-4">
<h4 id="org1a26558">バグ修正</h4>
<div class="outline-text-4" id="text-org1a26558">
<ul class="org-ul">
<li>コンパイラ、ランタイム、ライブラリバインディング、PPX にわたる多数のバグ修正。</li>
</ul>
</div>
</div>

<div id="outline-container-orgc80f778" class="outline-4">
<h4 id="orgc80f778">⚠️ 破壊的変更</h4>
<div class="outline-text-4" id="text-orgc80f778">
<p>
一部の変更はソース非互換です — 主に誤ったバインディングと動作を修正するためのもの — で、既存コードの更新が必要になる場合があります。<a href="https://github.com/ocsigen/js_of_ocaml/wiki/Upgrade-from-6.3.0-to-6.4.0">移行ガイド</a>を参照してください。
</p>

<p>
<a href="https://ocsigen.org/js_of_ocaml/">ドキュメント</a> および <a href="https://github.com/ocsigen/js_of_ocaml/blob/master/CHANGES.md">完全な変更履歴</a> もご覧ください。
</p>
</div>
</div>
</div>


<div id="outline-container-org82134d2" class="outline-3">
<h3 id="org82134d2">Vincent Balat が続けて追記しました</h3>
<div class="outline-text-3" id="text-org82134d2">
<p>
同時に Eliom 12.1 もリリースしました。js_of_ocaml 6.4 と OCaml 5.5 の両方との互換性を提供します。
</p>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">Ocsipersist 2.1.0: Deriving を使った型安全な永続参照</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocsipersist-2-1-0-type-safe-persistent-references-with-deriving/18283/1">https://discuss.ocaml.org/t/ann-ocsipersist-2-1-0-type-safe-persistent-references-with-deriving/18283/1</a>
</p>
</div>

<div id="outline-container-org10526a6" class="outline-3">
<h3 id="org10526a6">Vincent Balat が発表しました</h3>
<div class="outline-text-3" id="text-org10526a6">
<p>
<a href="https://ocsigen.org/ocsipersist/">Ocsipersist</a> 2.1.0 がリリースされました。永続参照、ストア、テーブルを <code>Marshal</code> の代わりに <code>Deriving_Json</code> でシリアライズできるようになりました。データはデータベース内で人間が読める形式になり、OCaml バージョン間でも安定しています。新しい API は完全に後方互換性があり、Ocsipersist は任意の OCaml プログラムのスタンドアロンライブラリとして動作します（Eliom や Ocsigen Server は不要です）。
</p>

<div class="org-src-container">
<pre class="src src-ocaml">type user = { name : string; age : int } [@@deriving json]

(* 読み取り可能な JSON として保存される永続参照 *)
let visits = Ocsipersist.Ref_json.ref ~persistent:"visits" [%json: int] 0

let count_visit () =
  let%lwt n = Ocsipersist.Ref_json.get visits in
  Ocsipersist.Ref_json.set visits (n + 1)
</pre>
</div>

<p>
完全なアナウンス: <a href="https://ocsigen.org/blog/posts/ocsipersist-2.1.0.html">https://ocsigen.org/blog/posts/ocsipersist-2.1.0.html</a>
</p>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">OCaml 5.5 以前における modular explicits</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://inbox.ci.dev/caml-list/6d5f115c-866d-4cc0-a102-73657778a0e2@inria.fr/T/">https://inbox.ci.dev/caml-list/6d5f115c-866d-4cc0-a102-73657778a0e2@inria.fr/T/</a>
</p>
</div>
