pr-preview/pr-32/2026.06.30.org
** oleg が述べました


先日発表された OCaml 5.5 の注目すべき機能の一つが、モジュール依存関数、すなわち modular explicits です。これは歓迎すべき追加機能で、最もシンプルな方法で higher-ranked 型を表現でき、型付き tagless-final コードに特に適しています。

しかしながら、modular explicits はそれ以前でも、ほとんど手間なく実現できたことを述べておくべきでしょう。この古いトリックを改めて紹介することには意義があると思います — 特に、OCaml 5.5 の modular explicits の対象外である静的に未知なモジュール（statically unknown modules）でも動作するからです。

実例として、OCaml 5.5 の発表（以下 Ann55）にあるプリティプリンティングの例を再利用します。

ただし、より単純な例から始めます: ~Set.Make~ functor で生成されたセットのプリティプリンティングです。この例は Ann55 の pp_map 関数のパターンに従っています。マップの表示と異なり higher-rank 型が含まれないため、より単純です。

#+begin_src ocaml
let pp_set (type a s) 
      (module M: Set.S with type elt = a and type t = s) 
      (pp_elt:Format.formatter->a->unit) (ppf:Format.formatter) (set:s) = 
  if M.is_empty set then Format.fprintf ppf "ø" else 
  let pp_sep ppf () = Format.fprintf ppf ",@ " in 
  Format.fprintf ppf "@[{@ %a@ }@]" 
    (Format.pp_print_seq ~pp_sep pp_elt) (M.to_seq set) 
#+end_src

これは Ann55 の pp_map の例をほぼそのままマップをセットに置き換えたものです。主な違いは型アノテーションです。これはバグではありません: 私はすべてのトップレベル定義（最も自明なものを除いて）にシグネチャや明示的な型アノテーションを書くことを強く推奨しています。

以下を導入することでアノテーションを簡略化できます:

#+begin_src ocaml
type ('e,'s) set = (module Set.S with type elt = 'e and type t = 's)
type 'a printer = Format.formatter->'a->unit
#+end_src

例はこのようになります:

#+begin_src ocaml
let pp_set : type e s. (e,s) set -> e printer -> s printer = 
  fun (module M) pp_elt ppf set -> (* ... 前と同様 ... *)
#+end_src

シグネチャを見れば pp_set が何をしているかが一目瞭然です（シグネチャの利点の一つです: コンパイラのためだけでも、主にコンパイラのためでもありません）。

pp_set は Ann55 の例での pp_map の使われ方と同様に使えます:

#+begin_src ocaml
module String_set = Set.Make(String) 

let () = 
  let m = String_set.of_list ["Zero"; "Zero"; "One"; "Un"] in 
  let pp_str = Format.pp_print_string in 
  Format.printf "%a@." (pp_set (module String_set) pp_str) m 
#+end_src

私たちの modular explicits の表現は、String_set のような静的に既知なモジュールを超えて拡張できます。例えば:

#+begin_src ocaml
(* 型 'e の要素を持つ抽象集合。実装は抽象的 *)

type 'e aset = (module Set.S with type elt = 'e)

let f : unit -> int aset = fun () -> 
  if Random.bool () then 
    (module Set.Make(Int)) 
  else 
    (module Set.Make(struct type t = int 
      let compare x y = - Int.compare x y end))
#+end_src

関数 f はランダムに二つの異なる Set 実装のいずれかを返します（Set.t 型には互換性がありません）。応用として、整数のリストをセットとして表示します（自動的にソートおよび重複削除されます）:

#+begin_src ocaml
let print_as_set : type a. a aset -> a printer -> a list printer  = 
  fun (module M) pp ppf lst -> 
    pp_set (module M) pp ppf (M.of_list lst)

let _ = Format.printf "%a@." 
    (print_as_set (f ()) Format.pp_print_int) [1;2;3;1]
#+end_src

結果は、サイコロの目に応じて "{ 1, 2, 3 }" または "{ 3, 2, 1 }" のいずれかになります。

次に Ann55 の pp_map の例に取り組みましょう。これはマップ型 'a Map.S.t の higher-rank 型のために難しい問題です。

モジュール型を次のように定義したくなります:

#+begin_src ocaml
type ('k,'v,'m) map = 
    (module Map.S with type key = 'k and type 'a t = 'm constraint 'a = 'v)
#+end_src

残念ながら、これは動作しません:

#+begin_example
2 |     (module Map.S with type key = 'k and type 'a t = 'm constraint 'a = 'v)
                                             ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
Error: Syntax error: invalid package type: parametrized types are not supported
#+end_example

パッケージ型とその ~with~ 制約には多くの制限があり、非常に残念です。

エンコーディングに頼る必要があります:

#+begin_src ocaml
module type maps = sig
  include Map.S
  type v
  type mt
  val of_mt : mt -> v t
  val to_mt : v t -> mt 
end
type ('k,'v,'m) map = 
    (module maps with type key = 'k and type v = 'v and type mt = 'm)
#+end_src

これはより一般的なマップ型であることを述べておくべきでしょう: キーと値の特定の組み合わせに対する特殊な実装をサポートします（例: 'v が bool の場合、基礎構造として Set を使用できます）。

マップのプリティプリンターは Ann55 と同様で、M.of_t の二つの出現が追加されています:

#+begin_src ocaml
let pp_map : type k v m. (k,v,m) map -> k printer -> v printer -> m printer = 
    fun (module M) pp_key pp_v ppf set -> 
  if M.is_empty (M.of_mt set) then Format.fprintf ppf "ø" else 
  let pp_sep ppf () = Format.fprintf ppf ",@ " in 
  let pp_binding ppf (k,v) = Format.fprintf ppf "@[%a@ =@ %a@]" pp_key k pp_v v 
  in 
  Format.fprintf ppf "@[{@ %a@ }@]" 
    (Format.pp_print_seq ~pp_sep pp_binding) (M.to_seq (M.of_mt set)) 
#+end_src

ただし Ann55 の pp_map とは異なり、静的に*未知*なモジュールにも適用できます:

#+begin_src ocaml
type ('k,'v) amap = (module maps with type key = 'k and type v = 'v)

let string_map : type a. unit -> (string,a) amap = fun () -> 
  (module struct
    include Map.Make(String) 
    type v = a
    type mt = v t
    let of_mt = Fun.id
    let to_mt = Fun.id
  end)

let () = 
  let md = string_map () in
  let module M = (val (md : (string,int) amap)) in
  let m = M.of_list ["Zero", 0; "One", 1] in 
  let pp_str = Format.pp_print_int in 
  Format.printf "%a@." 
    (pp_map (module M) Format.pp_print_string pp_str) (M.to_mt m)
#+end_src

to_mt のような関数は tagless-final インタープリタの場合に自然に現れることを述べておきましょう: これらは観察関数です。例えば:

#+begin_src ocaml
module type lc = sig
  type 'a repr
  val int : int -> int repr
  val lam  : ('a repr -> 'b repr) -> ('a -> 'b) repr
  val app : ('a -> 'b) repr -> ('a repr -> 'b repr)
  type obst
  type obs
  val observe : obst repr -> obs
end

type ('a,'obs) lc = (module (lc with type obs = 'obs and type obst = 'a))

let ex1 : type obs. (int,obs) lc -> obs = fun (module M) -> let open M in
  let t1 = app (lam (fun x -> x)) (int 1)
  in observe t1
#+end_src

結論として、パッケージ型の制限がいつか緩和されることを願っています。
      

** Olivier Nicole が質問し、Samuel Vivien が回答しました


#+begin_quote
ご指摘ありがとうございます。modular explicits は厳密に言えば言語に表現力を追加するものではなく、これらのことをより簡単に行うための方法を提供するだけということでしょうか？それとも modular explicits で表現できるが、制約付きモジュール型では表現できないプログラムが存在しますか？
#+end_quote

その通りです。Modular explicit は言語に表現力を追加しません（型システムの健全性にも影響しません）。modular explicits を使って書けるプログラムは、すべて第一級モジュールとしてエンコードされた functor を使って書くことができたはずです。

このエンコーディングについては、modular explicits に関するこの論文のセクション 1.5 で説明しています: https://hal.science/hal-05428136/document
      



* LRgrep 0.9: OCaml と Menhir のためのより良い構文エラー
:PROPERTIES:
:CUSTOM_ID: 5
:END:
Archive: https://discuss.ocaml.org/t/lrgrep-0-9-better-syntax-errors-for-ocaml-and-menhir/18286/1

** Frédéric Bour が発表しました


皆さん、こんにちは。

*LRgrep 0.9* をリリースしました。これは、失敗パスを推論することで Menhir が生成した LR パーサのエラーメッセージをカスタマイズするツールです。

目標は、汎用的な「X行目で構文エラー」というメッセージから、実際の根本原因を指摘するより直感的な診断メッセージへの移行です。例えば、ローカル let チェーンに誤ってセミコロンを置いてしまった場合:

#+begin_src ocaml
let x = 5;
  
let y = 6
  
let z = 7
^^^
Error: Expecting 'in' to complete local-let binding. 
Hint: this might be due to the semicolon line 1, character 9
#+end_src

LRgrep なしでは、OCaml は通常、後続の ~let~ バインディングに対してのみ構文エラーを報告します。カスタマイズされたパーサにより、セミコロンが原因である可能性を特定できます。

**フィードバックをお願いしています！**

現在の仕様のストレステストを行い、エラーメッセージがまだ不十分な箇所を特定するためにユーザーの協力を求めています。

1. **OCaml をお使いの方:** コンパイラに LRgrep パッチを当てています。opam でお試しください:
   ~opam switch create 5.4.1+lrgrep~
   **エラーメッセージが分かりにくい場合や、より有益なヒントが欲しいと感じた場合はご報告ください。**

2. **Menhir をお使いの方:** 独自のグラマーにエラーメッセージをカスタマイズしたい場合は LRgrep をお試しください。

   * [[https://github.com/fpottier/lrgrep-example][一般的な例]]
   * [[https://github.com/let-def/lrgrep/blob/main/examples/ocaml/parser/errors.lrgrep][OCaml エラー仕様]]

Merlin との統合も近日公開予定です（[[https://github.com/ocaml/merlin/pull/2072][PR #2072]]）。

@fpottier、@jmid、Tarides、Jane Street のサポートに深く感謝します。

Happy testing!
      



