pr-preview/pr-32/2026.06.30.org
* OCaml の静的解析
:PROPERTIES:
:CUSTOM_ID: 6
:END:
Archive: https://discuss.ocaml.org/t/blog-static-analysis-for-ocaml/18287/1

** fantazio が発表しました


皆さん、こんにちは。

OCaml の静的解析ツールの現状について短い（やや独断的な）記事を書きました。
利用可能なツール、開発中の取り組み、不足している部分の概要を提供することを目的としています。言及されていないがご使用の静的解析ツール、または存在してほしいと思うものがあればお知らせください。

ありがとうございます！

https://fantazio.eu/articles/static_analysis_ocaml.html
      



* 新リリース: OCaml 5.5 サポートを含む Merlin 5.8 と OCaml-LSP 1.27.0
:PROPERTIES:
:CUSTOM_ID: 7
:END:
Archive: https://discuss.ocaml.org/t/ann-new-releases-merlin-5-8-and-ocaml-lsp-1-27-0-with-support-for-ocaml-5-5/18293/1

** vds が発表しました


Merlin と OCaml-LSP の新リリースを発表できることを嬉しく思います 🧙 ！

Merlin は OCaml 向けにモダンな IDE 機能を提供するエディターサービスです。OCaml-LSP は LSP クライアントと通信する Merlin のフロントエンドです。

これらのリリースにはいくつかのバグ修正が含まれていますが、主な機能は OCaml 5.5 の安定サポートです。

完全な変更履歴:
- https://github.com/ocaml/merlin/blob/main/CHANGES.md#merlin-58
- https://github.com/ocaml/ocaml-lsp/blob/master/CHANGES.md#1270
      



* duras 2.1.1 — プレーンテキストファイルとしての日々のノート
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://discuss.ocaml.org/t/ann-duras-2-1-1-daily-notes-as-plain-text-files/18299/1

** Sergiy Duras が発表しました


*duras* は、プレーンテキストファイル（~YYYY/MM/YYYY-MM-DD.dn~）として保存される日々のノートのためのコマンドラインツールです。データベースなし、デーモンなし、バックグラウンドサービスなし。

v2.1.1 では ~duras build~ が追加され、ノートコレクションを静的 HTML ウェブサイトに変換します。7,300 件のノートを約220ms で処理、シングルスレッド、キャッシュなし。ノートは [[https://codeberg.org/duras/sigline][sigline]] フォーマットを使用します — 各行の先頭文字でその行の型を宣言するプレーンテキスト構造記法です。

- ソース: https://codeberg.org/duras/duras
- インストール: ~opam install duras~
- マニュアルページ: ~man duras~
      



* LexiFi（パリ）のソフトウェアエンジニア募集
:PROPERTIES:
:CUSTOM_ID: 9
:END:
Archive: https://discuss.ocaml.org/t/job-software-engineer-at-lexifi-paris/18304/1

** Nicolas Ojeda Bar が発表しました


皆さん、

[[https://www.lexifi.com/][LexiFi]] では採用を行っています！コア開発チームに参加するフルタイムのソフトウェアエンジニアを募集しています。

前職での業界経験、オープンソースプロジェクトへの貢献、実質的な個人プロジェクトなど、強力なプログラミングバックグラウンドを持つ候補者を特に求めています。

LexiFi は OCaml を 25 年以上使用しており — OCaml で製品を構築した最初のソフトウェア会社です — 現在もスタックの大部分を OCaml で実装しています。OCaml を使って実世界の産業問題を解決することに興味がある方は、ぜひご連絡ください。

https://www.lexifi.com/careers/software_engineer/

LexiFi での業務は複数のドメインにわたる幅広いプロジェクトに及びます。また、コミュニティプロジェクトへの資金提供、OCaml コンパイラやその他のオープンソースプロジェクトのメンテナンスへの協力、カンファレンスへの参加など、様々な形で OCaml コミュニティへの貢献にも積極的に取り組んでいます。

ご質問がございましたら、こちらまたは個別にお気軽にご連絡ください。

よろしくお願いします、
Nicolas
      



* Owebview: webview ライブラリへの OCaml バインディング
:PROPERTIES:
:CUSTOM_ID: 10
:END:
Archive: https://discuss.ocaml.org/t/owebview-ocaml-binding-to-the-webview-library/18305/1

** Korkorran が発表しました


皆さん、こんにちは！👋

取り組んできた小さなプロジェクトをご紹介します: *owebview*、[[https://github.com/webview/webview][webview]] のための OCaml バインディングセットです。

*** webview とは？

[[https://github.com/webview/webview][webview]] は、OS 組み込みの web エンジン（macOS では WebKit、Linux では WebKitGTK、Windows では WebView2）を使ってデスクトップ GUI を構築するための小さなクロスプラットフォームライブラリです。Electron のようにブラウザ全体を同梱する代わりにシステムのものを再利用するので、アプリを小さく保てます。ウィンドウを作成し、HTML（または URL）を指定すると、ページの JavaScript とホスト言語の間で相互に呼び出しができます。

*** owebview が埋めるギャップ

webview が非常に魅力的なのはそのエコシステムです: Go（リファレンス実装）、Rust、Python、C#、Nim、Zig など、すでに*多くの*言語向けバインディングがあります。しかし、私の調べた限り、*OCaml* 向けのものはありませんでした。

owebview はそのギャップを埋める試みです: OCaml から直接 webview を操作し、ページの JavaScript と OCaml 関数間のネイティブブリッジを提供する薄いバインディングです。

*** どのようなものか

完全なアプリは約10行です:

#+begin_src ocaml
let () =
  let w = Webview.create () in
  Webview.set_title w "My first owebview app";
  Webview.set_size w \~width:480 \~height:320 Webview.Hint_none;
  Webview.set_html w
  {|<!doctype html>
      <html><body style="font-family: system-ui; text-align: center">
        <h1>Hello from OCaml 👋</h1>
      </body></html>|};
  Webview.run w;
  Webview.destroy w
#+end_src

ページに OCaml 関数を公開することもできます — ここでは ~window.add(a, b)~ が OCaml から解決される JavaScript Promise を返します:

#+begin_src ocaml
Webview.bind w "add" (fun id req ->
  let result =
  match Scanf.sscanf_opt req "\[%d,%d\]" (fun a b -> a + b) with
  | Some n -> string_of_int n
  | None -> "null"
  in
  Webview.return w id \~error:false \~result)
#+end_src

*** 試してみる

#+begin_src shell
# バンドルされた例を実行
git clone https://github.com/korkorran/owebview.git
cd owebview
dune exec examples/hellowv.exe

# または独自プロジェクトに pin する
opam pin add owebview https://github.com/korkorran/owebview.git
#+end_src

その後、dune ファイルに ~(libraries owebview.webview)~ を追加するだけです。~webview.h~ ヘッダーはベンダリングされており、プラットフォーム固有の C++ フラグはビルド時に検出されます（Linux では ~pkg-config~ を使用）ので、手動での設定は不要です。

*** 率直な現状とお願い

これは**コンパクトなバインディング / 出発点**であり、まだ完全なライブラリではありません: 一部の機能（~unbind~、~dispatch~、完全なバインディングメモリ管理）は現時点では意図的に省略されています。

また、主に **macOS** で開発・テストされています。**Linux ディストリビューション**で実行されている方からのフィードバックをぜひいただきたいです — コンパイルできますか？opam の ~depexts~ は解決しますか？お使いのディストリビューションで ~webkit2gtk-4.1~ バックエンドは動作しますか？

Issue や PR は大歓迎です。

リポジトリ: https://github.com/korkorran/owebview

お読みいただきありがとうございます。感想、提案、そして特に Linux ビルドの報告をお待ちしています！
      



* OCaml Runtime ミーティング: 7月6日（月）UTC 10:00（ロンドン/ケンブリッジ 10:00、パリ 11:00、シドニー 19:00）
:PROPERTIES:
:CUSTOM_ID: 11
:END:
Archive: https://discuss.ocaml.org/t/ocaml-runtime-meeting-mon-july-6-10-00-utc-10-00-london-cambridge-11-00-paris-7pm-sydney/18312/1

** Tim McGilchrist が発表しました


次の OCaml Runtime ミーティングは 2026年7月6日（月）UTC 10:00（ロンドン/ケンブリッジ 10:00、パリ 11:00、シドニー 19:00）に開催されます。アジェンダのノートはこちらです https://hackmd.io/@tmcgilchrist/S1RtObvWGe カレンダー招待が必要な場合は tim@tarides.com にメールしてください。

おおよそ毎月、言語ランタイム/ガベージコレクターに焦点を当てた OCaml 開発者間の非公式ミーティングを開催しています。ミーティングは理解やアイデアを共有するためのもので、正式な計画を目的としていません。興味のある開発者はどなたでも参加できます。

過去のミーティングノートは https://github.com/ocaml/subsystem-meetings でご覧いただけます。
      



* 過去の CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

CWN を見逃した場合は、[[mailto:alan.schmitt@polytechnique.org][メッセージを送っていただければ]]メールでお送りします。また、[[https://ocaml.jp/cwn-ja/][アーカイブ]]や[[https://ocaml.jp/cwn-ja/cwn.rss][RSS フィード]]もご覧いただけます。

毎週メールで受け取りたい場合は、[[https://sympa.inria.fr/sympa/info/caml-list][caml-list]] を購読してください。

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
