ja/2026.06.30.html




<div id="outline-container-6" class="outline-2">
<h2 id="6">OCaml の静的解析</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/blog-static-analysis-for-ocaml/18287/1">https://discuss.ocaml.org/t/blog-static-analysis-for-ocaml/18287/1</a>
</p>
</div>

<div id="outline-container-org5a3cf5f" class="outline-3">
<h3 id="org5a3cf5f">fantazio が発表しました</h3>
<div class="outline-text-3" id="text-org5a3cf5f">
<p>
皆さん、こんにちは。
</p>

<p>
OCaml の静的解析ツールの現状について短い（やや独断的な）記事を書きました。
利用可能なツール、開発中の取り組み、不足している部分の概要を提供することを目的としています。言及されていないがご使用の静的解析ツール、または存在してほしいと思うものがあればお知らせください。
</p>

<p>
ありがとうございます！
</p>

<p>
<a href="https://fantazio.eu/articles/static_analysis_ocaml.html">https://fantazio.eu/articles/static_analysis_ocaml.html</a>
</p>
</div>
</div>
</div>




<div id="outline-container-7" class="outline-2">
<h2 id="7">新リリース: OCaml 5.5 サポートを含む Merlin 5.8 と OCaml-LSP 1.27.0</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-new-releases-merlin-5-8-and-ocaml-lsp-1-27-0-with-support-for-ocaml-5-5/18293/1">https://discuss.ocaml.org/t/ann-new-releases-merlin-5-8-and-ocaml-lsp-1-27-0-with-support-for-ocaml-5-5/18293/1</a>
</p>
</div>

<div id="outline-container-org89201ad" class="outline-3">
<h3 id="org89201ad">vds が発表しました</h3>
<div class="outline-text-3" id="text-org89201ad">
<p>
Merlin と OCaml-LSP の新リリースを発表できることを嬉しく思います 🧙 ！
</p>

<p>
Merlin は OCaml 向けにモダンな IDE 機能を提供するエディターサービスです。OCaml-LSP は LSP クライアントと通信する Merlin のフロントエンドです。
</p>

<p>
これらのリリースにはいくつかのバグ修正が含まれていますが、主な機能は OCaml 5.5 の安定サポートです。
</p>

<p>
完全な変更履歴:
</p>
<ul class="org-ul">
<li><a href="https://github.com/ocaml/merlin/blob/main/CHANGES.md#merlin-58">https://github.com/ocaml/merlin/blob/main/CHANGES.md#merlin-58</a></li>
<li><a href="https://github.com/ocaml/ocaml-lsp/blob/master/CHANGES.md#1270">https://github.com/ocaml/ocaml-lsp/blob/master/CHANGES.md#1270</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-8" class="outline-2">
<h2 id="8">duras 2.1.1 — プレーンテキストファイルとしての日々のノート</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-duras-2-1-1-daily-notes-as-plain-text-files/18299/1">https://discuss.ocaml.org/t/ann-duras-2-1-1-daily-notes-as-plain-text-files/18299/1</a>
</p>
</div>

<div id="outline-container-orgda47f24" class="outline-3">
<h3 id="orgda47f24">Sergiy Duras が発表しました</h3>
<div class="outline-text-3" id="text-orgda47f24">
<p>
<b>duras</b> は、プレーンテキストファイル（<code>YYYY/MM/YYYY-MM-DD.dn</code>）として保存される日々のノートのためのコマンドラインツールです。データベースなし、デーモンなし、バックグラウンドサービスなし。
</p>

<p>
v2.1.1 では <code>duras build</code> が追加され、ノートコレクションを静的 HTML ウェブサイトに変換します。7,300 件のノートを約220ms で処理、シングルスレッド、キャッシュなし。ノートは <a href="https://codeberg.org/duras/sigline">sigline</a> フォーマットを使用します — 各行の先頭文字でその行の型を宣言するプレーンテキスト構造記法です。
</p>

<ul class="org-ul">
<li>ソース: <a href="https://codeberg.org/duras/duras">https://codeberg.org/duras/duras</a></li>
<li>インストール: <code>opam install duras</code></li>
<li>マニュアルページ: <code>man duras</code></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-9" class="outline-2">
<h2 id="9">LexiFi（パリ）のソフトウェアエンジニア募集</h2>
<div class="outline-text-2" id="text-9">
<p>
Archive: <a href="https://discuss.ocaml.org/t/job-software-engineer-at-lexifi-paris/18304/1">https://discuss.ocaml.org/t/job-software-engineer-at-lexifi-paris/18304/1</a>
</p>
</div>

<div id="outline-container-orgace99e0" class="outline-3">
<h3 id="orgace99e0">Nicolas Ojeda Bar が発表しました</h3>
<div class="outline-text-3" id="text-orgace99e0">
<p>
皆さん、
</p>

<p>
<a href="https://www.lexifi.com/">LexiFi</a> では採用を行っています！コア開発チームに参加するフルタイムのソフトウェアエンジニアを募集しています。
</p>

<p>
前職での業界経験、オープンソースプロジェクトへの貢献、実質的な個人プロジェクトなど、強力なプログラミングバックグラウンドを持つ候補者を特に求めています。
</p>

<p>
LexiFi は OCaml を 25 年以上使用しており — OCaml で製品を構築した最初のソフトウェア会社です — 現在もスタックの大部分を OCaml で実装しています。OCaml を使って実世界の産業問題を解決することに興味がある方は、ぜひご連絡ください。
</p>

<p>
<a href="https://www.lexifi.com/careers/software_engineer/">https://www.lexifi.com/careers/software_engineer/</a>
</p>

<p>
LexiFi での業務は複数のドメインにわたる幅広いプロジェクトに及びます。また、コミュニティプロジェクトへの資金提供、OCaml コンパイラやその他のオープンソースプロジェクトのメンテナンスへの協力、カンファレンスへの参加など、様々な形で OCaml コミュニティへの貢献にも積極的に取り組んでいます。
</p>

<p>
ご質問がございましたら、こちらまたは個別にお気軽にご連絡ください。
</p>

<p>
よろしくお願いします、
Nicolas
</p>
</div>
</div>
</div>




<div id="outline-container-10" class="outline-2">
<h2 id="10">Owebview: webview ライブラリへの OCaml バインディング</h2>
<div class="outline-text-2" id="text-10">
<p>
Archive: <a href="https://discuss.ocaml.org/t/owebview-ocaml-binding-to-the-webview-library/18305/1">https://discuss.ocaml.org/t/owebview-ocaml-binding-to-the-webview-library/18305/1</a>
</p>
</div>

<div id="outline-container-org01ce69e" class="outline-3">
<h3 id="org01ce69e">Korkorran が発表しました</h3>
<div class="outline-text-3" id="text-org01ce69e">
<p>
皆さん、こんにちは！👋
</p>

<p>
取り組んできた小さなプロジェクトをご紹介します: <b>owebview</b>、<a href="https://github.com/webview/webview">webview</a> のための OCaml バインディングセットです。
</p>
</div>

<div id="outline-container-org316a142" class="outline-4">
<h4 id="org316a142">webview とは？</h4>
<div class="outline-text-4" id="text-org316a142">
<p>
<a href="https://github.com/webview/webview">webview</a> は、OS 組み込みの web エンジン（macOS では WebKit、Linux では WebKitGTK、Windows では WebView2）を使ってデスクトップ GUI を構築するための小さなクロスプラットフォームライブラリです。Electron のようにブラウザ全体を同梱する代わりにシステムのものを再利用するので、アプリを小さく保てます。ウィンドウを作成し、HTML（または URL）を指定すると、ページの JavaScript とホスト言語の間で相互に呼び出しができます。
</p>
</div>
</div>

<div id="outline-container-orgc6dd4b3" class="outline-4">
<h4 id="orgc6dd4b3">owebview が埋めるギャップ</h4>
<div class="outline-text-4" id="text-orgc6dd4b3">
<p>
webview が非常に魅力的なのはそのエコシステムです: Go（リファレンス実装）、Rust、Python、C#、Nim、Zig など、すでに<b>多くの</b>言語向けバインディングがあります。しかし、私の調べた限り、<b>OCaml</b> 向けのものはありませんでした。
</p>

<p>
owebview はそのギャップを埋める試みです: OCaml から直接 webview を操作し、ページの JavaScript と OCaml 関数間のネイティブブリッジを提供する薄いバインディングです。
</p>
</div>
</div>

<div id="outline-container-org882f23c" class="outline-4">
<h4 id="org882f23c">どのようなものか</h4>
<div class="outline-text-4" id="text-org882f23c">
<p>
完全なアプリは約10行です:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">let () =
  let w = Webview.create () in
  Webview.set_title w "My first owebview app";
  Webview.set_size w \~width:480 \~height:320 Webview.Hint_none;
  Webview.set_html w
  {|&lt;!doctype html&gt;
      &lt;html&gt;&lt;body style="font-family: system-ui; text-align: center"&gt;
        &lt;h1&gt;Hello from OCaml 👋&lt;/h1&gt;
      &lt;/body&gt;&lt;/html&gt;|};
  Webview.run w;
  Webview.destroy w
</pre>
</div>

<p>
ページに OCaml 関数を公開することもできます — ここでは <code>window.add(a, b)</code> が OCaml から解決される JavaScript Promise を返します:
</p>

<div class="org-src-container">
<pre class="src src-ocaml">Webview.bind w "add" (fun id req -&gt;
  let result =
  match Scanf.sscanf_opt req "\[%d,%d\]" (fun a b -&gt; a + b) with
  | Some n -&gt; string_of_int n
  | None -&gt; "null"
  in
  Webview.return w id \~error:false \~result)
</pre>
</div>
</div>
</div>

<div id="outline-container-org71629a3" class="outline-4">
<h4 id="org71629a3">試してみる</h4>
<div class="outline-text-4" id="text-org71629a3">
<div class="org-src-container">
<pre class="src src-shell"># バンドルされた例を実行
git clone https://github.com/korkorran/owebview.git
cd owebview
dune exec examples/hellowv.exe

# または独自プロジェクトに pin する
opam pin add owebview https://github.com/korkorran/owebview.git
</pre>
</div>

<p>
その後、dune ファイルに <code>(libraries owebview.webview)</code> を追加するだけです。<code>webview.h</code> ヘッダーはベンダリングされており、プラットフォーム固有の C++ フラグはビルド時に検出されます（Linux では <code>pkg-config</code> を使用）ので、手動での設定は不要です。
</p>
</div>
</div>

<div id="outline-container-orgf3d16e2" class="outline-4">
<h4 id="orgf3d16e2">率直な現状とお願い</h4>
<div class="outline-text-4" id="text-orgf3d16e2">
<p>
これは<b><b>コンパクトなバインディング / 出発点</b></b>であり、まだ完全なライブラリではありません: 一部の機能（<code>unbind</code>、<code>dispatch</code>、完全なバインディングメモリ管理）は現時点では意図的に省略されています。
</p>

<p>
また、主に <b><b>macOS</b></b> で開発・テストされています。<b><b>Linux ディストリビューション</b></b>で実行されている方からのフィードバックをぜひいただきたいです — コンパイルできますか？opam の <code>depexts</code> は解決しますか？お使いのディストリビューションで <code>webkit2gtk-4.1</code> バックエンドは動作しますか？
</p>

<p>
Issue や PR は大歓迎です。
</p>

<p>
リポジトリ: <a href="https://github.com/korkorran/owebview">https://github.com/korkorran/owebview</a>
</p>

<p>
お読みいただきありがとうございます。感想、提案、そして特に Linux ビルドの報告をお待ちしています！
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-11" class="outline-2">
<h2 id="11">OCaml Runtime ミーティング: 7月6日（月）UTC 10:00（ロンドン/ケンブリッジ 10:00、パリ 11:00、シドニー 19:00）</h2>
<div class="outline-text-2" id="text-11">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-runtime-meeting-mon-july-6-10-00-utc-10-00-london-cambridge-11-00-paris-7pm-sydney/18312/1">https://discuss.ocaml.org/t/ocaml-runtime-meeting-mon-july-6-10-00-utc-10-00-london-cambridge-11-00-paris-7pm-sydney/18312/1</a>
</p>
</div>

<div id="outline-container-org3e97405" class="outline-3">
<h3 id="org3e97405">Tim McGilchrist が発表しました</h3>
<div class="outline-text-3" id="text-org3e97405">
<p>
次の OCaml Runtime ミーティングは 2026年7月6日（月）UTC 10:00（ロンドン/ケンブリッジ 10:00、パリ 11:00、シドニー 19:00）に開催されます。アジェンダのノートはこちらです <a href="https://hackmd.io/@tmcgilchrist/S1RtObvWGe">https://hackmd.io/@tmcgilchrist/S1RtObvWGe</a> カレンダー招待が必要な場合は tim@tarides.com にメールしてください。
</p>

<p>
おおよそ毎月、言語ランタイム/ガベージコレクターに焦点を当てた OCaml 開発者間の非公式ミーティングを開催しています。ミーティングは理解やアイデアを共有するためのもので、正式な計画を目的としていません。興味のある開発者はどなたでも参加できます。
</p>

<p>
過去のミーティングノートは <a href="https://github.com/ocaml/subsystem-meetings">https://github.com/ocaml/subsystem-meetings</a> でご覧いただけます。
</p>
</div>
</div>
</div>




<div id="outline-container-org5844e52" class="outline-2">
<h2 id="org5844e52">過去の CWN</h2>
<div class="outline-text-2" id="text-org5844e52">
<p>
CWN を見逃した場合は、<a href="mailto:alan.schmitt@polytechnique.org">メッセージを送っていただければ</a>メールでお送りします。また、<a href="https://ocaml.jp/cwn-ja/">アーカイブ</a>や<a href="https://ocaml.jp/cwn-ja/cwn.rss">RSS フィード</a>もご覧いただけます。
</p>

<p>
毎週メールで受け取りたい場合は、<a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a> を購読してください。
</p>

<div class="authorname" id="orgb687987">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>